╔╒╧┐г├  е╟е╒ейеые╚д╟д╬╡б╟╜░ь═ў╔╜


  евеые╒ебе┘е├е╚╞■╬╧╛ї┬╓д╦дкд▒ды╡б╟╜
игибибибибибибибибибибииибибибибибибибибибибибибибииибибибибибибибибибибибибид
ив     ╡б  ╟╜         ив      енб╝┴р║ю            ив    ╚ў            ╣═    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞№╦▄╕ь╞■╬╧етб╝е╔д╪д╬ивигибибибибибид            ив                        ив
ив░▄╣╘                ивив г╪г╞г┼г╥ ивбдг├б▌гя    ив                        ив
ив                    ивижибибибибибие            ив                        ив
ижибибибибибибибибибибикибибибибибибибибибибибибибикибибибибибибибибибибибибие

  ╞╔д▀╞■╬╧дмд╩дд╛ї┬╓д╦дкд▒ды╡б╟╜
игибибибибибибибибибибииибибибибибибибибибибибибибииибибибибибибибибибибибибид
ив     ╡б  ╟╜         ив      енб╝┴р║ю            ив    ╚ў            ╣═    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ивевеые╒ебе┘е├е╚етб╝е╔ивигибибибибибид            ив                        ив
ив                    ивив г╪г╞г┼г╥ ивбдг├б▌гя    ив                        ив
ивд╪д╬░▄╣╘            ивижибибибибибие            ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀д╬╞■╬╧          ив a,b,cб─0,1б─             ивевеые╒ебе┘е├е╚дф╡н╣цдЄ  ив
ив                    ив                          ив╞■╬╧д╣дыд│д╚д╦дшдъ╞╔д▀дмив
ив                    ив                          ив╞■╬╧д╡дьд┐╛ї┬╓д╪░▄╣╘д╣дыив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╡н╣ц╞■╬╧етб╝е╔д╪д╬  ивигибибибибид              ив                        ив
ив                    ивив г╔г╬г╙ ив              ив                        ив
ив░▄╣╘                ивижибибибибие              ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив░·═╤╩╕╗·╬єд╬┴▐╞■    ив г├б▌гё                   ив░·═╤╩╕╗·╬єд╬┴▐╞■дЄ╣╘джбгив
ив                    ив                          ив░·═╤╩╕╗·╬єд╬┴▐╞■дЄ│л╗╧д╣ив
ив                    ив                          ивдыд┐дсд╬╩╕╗·д╬╝бд╬░ь╩╕╗·ив
ив                    ив                          ивдЄеэб╝е▐╗·длд╩╩╤┤╣д╗д║╞■ив
ив                    ив                          ив╬╧д╣дыбг                ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ивецб╝е╞егеъе╞ег      ивигибибибибибид            ивецб╝е╞егеъе╞егетб╝е╔д╦╞■ив
ив                    ивив г╚г┼г╠г╨ ив            ивдыбг                    ив
ив                    ивижибибибибибие            ив                        ив
ижибибибибибибибибибибикибибибибибибибибибибибибибикибибибибибибибибибибибибие

  ╞╔д▀дЄ╞■╬╧д╖д╞ддды╛ї┬╓д╦дкд▒ды╡б╟╜
игибибибибибибибибибибииибибибибибибибибибибибибибииибибибибибибибибибибибибид
ив     ╡б  ╟╜         ив      енб╝┴р║ю            ив    ╚ў            ╣═    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀д╬║я╜№          ивигибибибид                ив║╕├╝д╟д╬║╕╩¤╕■║я╜№╡┌д╙▒жив
ив                    ивив г┬г╙ ив,г├б▌гш(║╕╩¤╕■) ив├╝д╟д╬▒ж╩¤╕■║я╜№д╧╠╡╕·д╟ив
ив                    ивижибибибие                ивдвдыбг║я╜№д╖д┐╖ы▓╠╞╔д▀дмив
ив                    ив                          ив╢їд╦д╩д├д┐╛ь╣чд╦д╧╞╔д▀дмив
ив                    ив                          ивд╩дд╛ї┬╓д╦╠сдыбг        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гф(▒ж╩¤╕■)           ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гы(елб╝е╜еы░▄╣╘)     ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ивелб╝е╜еыд╬░▄╞░      ив г├б▌гс(║╕├╝)             ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гх(▒ж├╝)             ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив║╕├╝длдщ║╕д╪░▄╞░д╖дшджд╚ив
ив                    ививвливбдг├б▌гт(║╕д╪)      ивд╣дыд╚▒ж├╝д╪░▄╞░д╣дыбг  ив
ив                    ивижибие                    ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив▒ж├╝длдщ▒жд╪░▄╞░д╖дшджд╚ив
ив                    ививвкивбдг├б▌гцб╩▒жд╪б╦    ивд╣дыд╚║╕├╝д╪░▄╞░д╣дыбг  ив
ив                    ивижибие                    ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀дЄ┤┴╗·д╦╩╤┤╣    ивигибибибид игибибибид     ив                        ив
ив                    ививSpase ив,ив XFER ив     ив├▒╕ї╩ф╔╜╝и╛ї┬╓д╦░▄дыбг  ив
ив                    ивижибибибие ижибибибие     ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀дЄд╜д╬д▐д▐│╬─ъ  ивигибибибибид  игибибибид  ив╞╔д▀дЄ│╬─ъд╖бд╞╔д▀дмд╩ддив
ив                    ивив Return ив, ив NFER ив, ив╛ї┬╓д╦╠сдыбг            ив
ив                    ивижибибибибие  ижибибибие  ив                        ив
ив                    ив г├б▌гэ                   ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀д╬╩╕╗·╝я╩╤┤╣    ивигибид                    ив                        ив
ив                    ививвнивбдг├б▌гюб╩╜ч╩╤┤╣б╦  ив╩╕╗·╝я╩╤┤╣╛ї┬╓д╦░▄ды    ив
ив                    ивижибие                    ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив                        ив
ив                    ививвмивбдг├б▌гЁб╩╡╒╩╤┤╣б╦  ив                        ив
ив                    ивижибие                    ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞■╬╧д╣ды╩╕╗·д╬╝я╬рд╬ив г├б▌гщб╩╜ч▓єдъб╦         ив[ев]вк[ев](╚╛│╤)вк[гс]вкив
ив╩╤┤╣                ив                          ив[гс]╜чд╟╞■╬╧д╣ды╩╕╗·д╬╝яив
ив                    ив                          ив╬рдЄ└┌дъ┬╪дидыбг        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гяб╩╡╒▓єдъб╦         ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀д╬╝шдъ╛├д╖      ив г├б▌гч                   ив╞╔д▀дЄ╝шдъ╛├д╖бд╞╔д▀дм╠╡ив
ив                    ив                          ивдд╛ї┬╓д╦╠сды            ив
ив                    ив                          ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив░·═╤╩╕╗·╬єд╬┴▐╞■    ив г├б▌гё                   ив░·═╤╩╕╗·╬єд╬┴▐╞■дЄ╣╘джбгив
ив                    ив                          ив░·═╤╩╕╗·╬єд╬┴▐╞■дЄ│л╗╧д╣ив
ив                    ив                          ивдыд┐дсд╬╩╕╗·д╬╝бд╬░ь╩╕╗·ив
ив                    ив                          ивдЄеэб╝е▐╗·длд╩╩╤┤╣д╗д║╞■ив
ив                    ив                          ив╬╧д╣дыбг                ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀дЄг▒г╢┐╩е│б╝е╔д╚ив г├б▌г∙                   ив                        ив
ивд▀д╩д╖д╞╩╤┤╣        ив                          ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀дЄ╔Ї╝є╠╛д╚д▀д╩д╖ив г├б▌гў                   ив                        ив
ивд╞╩╤┤╣              ив                          ив                        ив
ижибибибибибибибибибибикибибибибибибибибибибибибибикибибибибибибибибибибибибие

  ├▒╕ї╩ф╔╜╝и╛ї┬╓д╦дкд▒ды╡б╟╜
игибибибибибибибибибибииибибибибибибибибибибибибибииибибибибибибибибибибибибид
ив     ╡б  ╟╜         ив      енб╝┴р║ю            ив    ╚ў            ╣═    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀д╬╞■╬╧          ив a,b,cб─0,1б─             ив╕ї╩фдЄ│╬─ъд╖╝бд╬╞╔д▀дЄ╞■ив
ив                    ив                          ив╬╧д╣дыбг╞╔д▀дЄ╞■╬╧д╖д╞ддив
ив                    ив                          ивды╛ї┬╓д╚д╩дыбг          ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив│╬    ─ъ            ивигибибибибид  игибибибид  ив╕ї╩фдЄ│╬─ъд╖бд╞╔д▀д╬д╩ддив
ив                    ивив Return ив, ив NFER ив, ив╛ї┬╓д╦╠сдыбг            ив
ив                    ивижибибибибие  ижибибибие  ив                        ив
ив                    ив г├б▌гэ                   ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╔Ї╩м│╬─ъ            ив г├б▌гы                   ивелб╝е╜еы╔Ї╩мдшдъ║╕д╬╩╕└сив
ив                    ив                          ивдЄ│╬─ъд╖бделб╝е╜еыдшдъ╕хив
ив                    ив                          ивд╬╔Ї╩мд╧╞╔д▀д╦╠сдыбг    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╠╡╩╤┤╣╛ї┬╓д╪д╬░▄╣╘  ивигибибибид                ив╞╔д▀дЄ╞■╬╧д╖д╞ддды╛ї┬╓д╦ив
ив                    ивив г┬г╙ ивбдг├б▌гч        ив╠сдыбг                  ив
ив                    ивижибибибие                ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╩╕└с┤╓д╬░▄╞░        ив г├б▌гсб╩║╕├╝б╦           ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гхб╩▒ж├╝б╦           ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив║╕├╝длдщ║╕д╪░▄╞░д╖дшджд╚ив
ив                    ививвливбдг├б▌гтб╩║╕д╪б╦    ивд╣дыд╚▒ж├╝д╪░▄╞░д╣дыбг  ив
ив                    ивижибие                    ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив▒ж├╝длдщ▒жд╪░▄╞░д╖дшджд╚ив
ив                    ививвкивбдг├б▌гцб╩▒жд╪б╦    ивд╣дыд╚║╕├╝д╦░▄╞░д╣дыбг  ив
ив                    ивижибие                    ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╩╕└сд╬┐н╜╠          ивигибибид                  ив╩╕└сд╧░ь╩╕╗·─╣░╩▓╝д╦д╧╜╠ив
ив                    ививTAB ив,г├б▌гщ(╩╕└с╜╠дс) ивд▐д╩дд                  ив
ив                    ивижибибие                  ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гяб╩╩╕└с┐нд╨д╖б╦     ивд╜д╬╩╕└сдшдъ╕хд╬╩╕└сдм╢їив
ив                    ив                          ивд╦д╩д├д┐╛ь╣чд╧д╜дь░╩╛х╩╕ив
ив                    ив                          ив└с┐нд╨д╖┴р║юд╧╣╘дид╩ддбгив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╝б╕ї╩фб┐┴░╕ї╩фд╬╔╜╝иивигибибибид  игибибибид    ив║╟╕хд╬╕ї╩фд╬╗■д╦╝б╕ї╩фдЄив
ив                    ививSpace ив, ив XFER ив    ив╔╜╝ид╖дшджд╚д╣дыд╚бд░ь╚╓ив
ив                    ивижибибибие  ижибибибие    ив╜щдсд╬╕ї╩фд╦░▄╞░д╣дыбг  ив
ив                    ивигибид                    ив                        ив
ив                    ививвнивбдг├б▌гюб╩╝б╕ї╩фб╦  ив                        ив
ив                    ивижибие                    ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив║╟╜щд╬╕ї╩фд╬╗■д╦┴░╕ї╩фдЄив
ив                    ививвмивбдг├б▌гЁб╩┴░╕ї╩фб╦  ив╔╜╝ид╖дшджд╚д╣дыд╚бд░ь╚╓ив
ив                    ивижибие                    ив║╟╕хд╬╕ї╩фд╦░▄╞░д╣дыбг  ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╕ї╩ф░ь═ў╔╜╝и        ив г├б▌гў                   ив╕ї╩ф░ь═ў╔╜╝и╛ї┬╓д╦░▄╣╘д╣ив
ив                    ив                          ивдыбг                    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╩╕└сд╬╩╘╜╕          ив г├б▌гу                   ивелеьеєе╚╩╕└сдЄ╞╔д▀д╦╠сд╖ив
ив                    ив                          ивбд╩╘╜╕етб╝е╔д╦д╩дыбг    ив
ижибибибибибибибибибибикибибибибибибибибибибибибибикибибибибибибибибибибибибие

  ╕ї╩ф░ь═ў╔╜╝и╛ї┬╓д╦дкд▒ды╡б╟╜
игибибибибибибибибибибииибибибибибибибибибибибибибииибибибибибибибибибибибибид
ив     ╡б  ╟╜         ив      енб╝┴р║ю            ив    ╚ў            ╣═    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив┴к  ┬Є              ивигибибибибид  игибибибид  ив╕ї╩фдЄ┴к┬Єд╖д╞бд├▒╕ї╩ф╔╜ив
ив                    ивив Return ив, ив NFER ив, ив╝и╛ї┬╓д╦░▄дыбг          ив
ив                    ивижибибибибие  ижибибибие  ив                        ив
ив                    ив г├б▌гэ                   ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╝б╕ї╩фб┐┴░╕ї╩фд╪д╬  ив г├б▌гсб╩║╕├╝б╦           ив                        ив
ив░▄╞░                ив                          ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гхб╩▒ж├╝б╦           ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив╕ї╩ф╬єд╬║╕├╝д╟┴░╕ї╩фд╪░▄ив
ив                    ививвливбдг├б▌гтб╩┴░╕ї╩фд╪б╦ив╞░д╣дыд╚┴░╕ї╩ф╬єд╬▒ж├╝д╪ив
ив                    ивижибие                    ив░▄╞░д╣дыбг├вд╖бд║╟╜щд╬╕їив
ив                    ив                          ив╩ф╬єд╟двд├д┐╛ь╣чд╦д╧бд║╟ив
ив                    ив                          ив╕хд╬╕ї╩ф╬єд╬║╕├╝д╦░▄╞░д╣ив
ив                    ив                          ивдыбг                    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╝б╕ї╩фб┐┴░╕ї╩фд╪д╬░▄ивигибибибид  игибибибид    ив╕ї╩ф╬єд╬▒ж├╝д╟╝б╕ї╩фд╪░▄ив
ив╞░                  ививSpace ив, ив XFER ив    ив╞░д╣дыд╚╝б╕ї╩ф╬єд╬║╕├╝д╦ив
ив                    ивижибибибие  ижибибибие    ив░▄╞░д╣дыбг├вд╖бд║╟╕хд╬╕їив
ив                    ивигибид                    ив╩ф╬єд╟двд├д┐╛ь╣чд╦д╧бд║╟ив
ив                    ививвкивбдг├б▌гцб╩╝б╕ї╩фд╪б╦ив╜щд╬╕ї╩ф╬єд╬║╕├╝д╦░▄╞░д╣ив
ив                    ивижибие                    ивдыбг                    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╚╓╣цд╦дшды░▄╞░      ив г▒б┴г╣                   ив┬╨▒■д╣ды╚╓╣цд╬╕ї╩фд╦░▄╞░ив
ив                    ив                          ивд╣дыбг                  ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╝б╕ї╩ф╬єб┐┴░╕ї╩ф╬єд╬ивигибид                    ив║╟╕хд╬╕ї╩ф╬єд╟╝б╕ї╩ф╬єд╪ив
ив╔╜╝и                ививвнивбдг├б▌гюб╩╝б╕ї╩ф╬єб╦ив░▄╞░д╣дыд╚║╟╜щд╬╕ї╩ф╬єд╬ив
ив                    ивижибие                    ив╞▒д╕╚╓╣цд╬╕ї╩фд╦░▄╞░д╣дыив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив║╟╜щд╬╕ї╩ф╬єд╟┴░╕ї╩ф╬єд╪ив
ив                    ививвмивбдг├б▌гЁб╩┴░╕ї╩ф╬єб╦ив░▄╞░д╣дыд╚║╟╕хд╬╕ї╩ф╬єд╬ив
ив                    ивижибие                    ив╞▒д╕╚╓╣цд╬╕ї╩фд╦░▄╞░д╣дыив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╕ї╩ф░ь═ў╔╜╝ид╬╝шдъ  ивигибибибид                ив├▒╕ї╩ф╛ї┬╓д╦╠сдыбг      ив
ив╛├д╖                ивив г┬г╙ ивбдг├б▌гч        ив                        ив
ив                    ивижибибибие                ив                        ив
ижибибибибибибибибибибикибибибибибибибибибибибибибикибибибибибибибибибибибибие

  ╩╕╗·╝я╩╤┤╣╛ї┬╓д╦дкд▒ды╡б╟╜    
игибибибибибибибибибибииибибибибибибибибибибибибибииибибибибибибибибибибибибид
ив     ╡б  ╟╜         ив      енб╝┴р║ю            ив    ╚ў            ╣═    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╝бд╬╞╔д▀д╬╞■╬╧      ив a,b,cб─0,1б─             ив╗·╝я╩╤┤╣дЄ│╬─ъд╖бд╝бд╬╞╔ив
ив                    ив                          ивд▀дЄ╞■╬╧д╣дыбг          ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив│╬  ─ъ              ивигибибибибид  игибибибид  ив╗·╝я╩╤┤╣дЄ│╬─ъд╖бд╞╔д▀д╬ив
ив                    ивив Return ив, ив NFER ив, ивд╩дд╛ї┬╓д╦╠сдыбг        ив
ив                    ивижибибибибие  ижибибибие  ив                        ив
ив                    ив г├б▌гэ                   ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╞╔д▀д╬╩╕╗·╝я╩╤┤╣    ивигибид                    ив╝бд╬╗·╝ядмд╥дщдмд╩д╟╗·╝яив
ив                    ививвнивбдг├б▌гюб╩╜ч╩╤┤╣б╦  ив╩╤┤╣╬╬░шд╚╠д│╬─ъ╩╕╗·╬єдмив
ив                    ивижибие                    ив░ь├╫д╖д╞дддыд╚днд╧бд╗·╝яив
ив                    ив                          ив╩╤┤╣етб╝е╔длдщ╚┤д▒д╞бд╞╔ив
ив                    ив                          ивд▀дЄ╞■╬╧д╖д╞ддды╛ї┬╓д╦д╩ив
ив                    ив                          ивдыбг                    ив
ив                    изибибибибибибибибибибибибибий                        ив
ив                    ивигибид                    ив                        ив
ив                    ививвмивбдг├б▌гЁб╩╡╒╩╤┤╣б╦  ив                        ив
ив                    ивижибие                    ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╗·╝я╩╤┤╣д╬╝шдъ╛├д╖  ивигибибибид                ив╗·╝я╩╤┤╣д╬д╚дъдфдсбд╞╔д▀ив
ив                    ивив г┬г╙ ивбдг├б▌гч        ивдЄ╞■╬╧д╖д╞ддды╛ї┬╓д╦╠сдыив
ив                    ивижибибибие                ивбг                      ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╩╕╗·╝я╩╤┤╣╬╬░шд╬┐н╜╠ив г├б▌гяб╩╬╬░ш┐нд╨д╖б╦     ив╞╔д▀┴┤┬╬дм╩╕╗·╝я╩╤┤╣д╬┬╨ив
ив                    ив                          ив╛▌д╟двдыд╚днд╦бд╬╬░ш┐нд╨ив
ив                    ив                          ивд╖дЄ╣╘джд╚бд║╕├╝д╬░ь╩╕╗·ив
ив                    ив                          ивд╬д▀дм┬╨╛▌╬╬░шд╚д╩дыбг  ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╩╕╗·╝я╩╤┤╣╬╬░шд╬┐н╜╠ивигибибид                  ив╬╬░шдм░ь╩╕╗·─╣д╬╗■д╦╬╬░шив
ив                    ививTAB ив, г├б▌гщ(╬╬░ш╜╠дс)ив╜╠дсдЄ╣╘джд╚бд╞╔д▀┴┤┬╬дмив
ив                    ивижибибие                  ив╩╕╗·╝я╩╤┤╣д╬┬╨╛▌╬╬░шд╚д╩ив
ив                    ив                          ивдыбг                    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив┬ч╩╕╗·б┐╛о╩╕╗·╩╤┤╣  ив г├б▌гїб╩┬ч╩╕╗·╩╤┤╣б╦     ив▒╤┐Їетб╝е╔д╬╗■д╬д▀═н╕·  ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гщб╩╛о╩╕╗·╩╤┤╣б╦     ив▒╤┐Їетб╝е╔д╬╗■д╬д▀═н╕·  ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив┤┴╗·д╪д╬╩╤┤╣        ивигибибибид  игибибибид    ив                        ив
ив                    ививSpace ивбдив XFER ив    ив                        ив
ив                    ивижибибибие  ижибибибие    ив                        ив
ижибибибибибибибибибибикибибибибибибибибибибибибибикибибибибибибибибибибибибие

  ╡н╣ц╞■╬╧етб╝е╔д╦дкд▒ды╡б╟╜
игибибибибибибибибибибииибибибибибибибибибибибибибииибибибибибибибибибибибибид
ив     ╡б  ╟╜         ив      енб╝┴р║ю            ив    ╚ў            ╣═    ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив┴к  ┬Є              ивигибибибибид  игибибибид  ив╕ї╩фдЄ┴к┬Єд╖д╞бд╞╔д▀д╬д╩ив
ив                    ивив Return ив, ив NFER ив  ивдд╛ї┬╓д╦░▄дыбг          ив
ив                    ивижибибибибие  ижибибибие  ив                        ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╝б╕ї╩фб┐┴░╕ї╩фд╪д╬  ив г├б▌гсб╩║╕├╝б╦           ив                        ив
ив░▄╞░                изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ив г├б▌гхб╩▒ж├╝б╦           ив                        ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив╕ї╩ф╬єд╬║╕├╝д╟┴░╕ї╩фд╪░▄ив
ив                    ививвливбдг├б▌гтб╩┴░╕ї╩фд╪б╦ив╞░д╣дыд╚┴░╕ї╩ф╬єд╬▒ж├╝д╦ив
ив                    ивижибие                    ив░▄╞░д╣дыбгд┐д└д╖бд║╟╜щд╬ив
ив                    ив                          ив╕ї╩ф╬єд╟двд├д┐╛ь╣чд╦д╧бдив
ив                    ив                          ив║╟╕хд╬╕ї╩ф╬єд╬▒ж├╝д╦░▄╞░ив
ив                    ив                          ивд╣дыбг                  ив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибибибид  игибибибид    ив╕ї╩ф╬єд╬▒ж├╝д╟╝б╕ї╩фд╪░▄ив
ив                    ививSpace ив, ив XFER ив    ив╞░д╣дыд╚╝б╕ї╩ф╬єд╬║╕├╝д╦ив
ив                    ивижибибибие  ижибибибие    ив░▄╞░д╣дыбгд┐д└д╖бд║╟╕хд╬ив
ив                    ивигибид                    ив╕ї╩ф╬єд╟двд├д┐╛ь╣чд╦д╧бдив
ив                    ививвкивбдг├б▌гцб╩╝б╕ї╩фд╪б╦ив║╟╜щд╬╕ї╩ф╬єд╬║╕├╝д╦░▄╞░ив
ив                    ивижибие                    ивд╣дыбг                  ив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╝б╕ї╩ф╬єб┐┴░╕ї╩ф╬єд╬ивигибид                    ив║╟╕хд╬╕ї╩ф╬єд╟╝б╕ї╩ф╬єд╪ив
ив╔╜╝и                ививвнивбдг├б▌гюб╩╝б╕ї╩ф╬єб╦ив░▄╞░д╣дыд╚║╟╜щд╬╕ї╩ф╬єд╬ив
ив                    ивижибие                    ив╞▒д╕╚╓╣цд╬╕ї╩фд╦░▄╞░д╣дыив
ив                    изибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив                    ивигибид                    ив║╟╜щд╬╕ї╩ф╬єд╟┴░╕ї╩ф╬єд╪ив
ив                    ививвмивбдг├б▌гЁб╩┴░╕ї╩ф╬єб╦ив░▄╞░д╣дыд╚║╟╕хд╬╕ї╩ф╬єд╬ив
ив                    ивижибие                    ив╞▒д╕╚╓╣цд╬╕ї╩фд╦░▄╞░д╣дыив
изибибибибибибибибибибилибибибибибибибибибибибибибилибибибибибибибибибибибибий
ив╡н╣ц╞■╬╧д╬╝шдъ╛├д╖  ивигибибибид                ив╞╔д▀д╬д╩дд╛ї┬╓д╦╠сдыбг  ив
ив                    ивив г┬г╙ ивбдг├б▌гч        ив                        ив
ив                    ивижибибибие                ив                        ив
ижибибибибибибибибибибикибибибибибибибибибибибибибикибибибибибибибибибибибибие
